#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/cf06618b85acfcd6]
module.rds.aws_db_option_group.this: Refreshing state... [id=machamp-staging]
module.rds.aws_db_parameter_group.this: Refreshing state... [id=machamp-staging]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/f5ed223c4e7e9aed/999269377cadf747]
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210620044835426500000001]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-07df5bf1d18c9632e]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0315e5c0ce17adcc2]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0d95fdfdf3b60ab2e]
module.alb_sg.aws_security_group.this: Refreshing state... [id=sg-02ac63eb789f2e837]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-006d11086a98fc4af]
module.ecs_task_sg.aws_security_group.this: Refreshing state... [id=sg-0d79e41b8c58f21be]
module.db_sg.aws_security_group.this: Refreshing state... [id=sg-0e7f2b8890b526257]
module.network.aws_route.public: Refreshing state... [id=r-rtb-0315e5c0ce17adcc21080289494]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2493006888]
module.alb_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2072193351]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2328878409]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0a6d425660dd82129]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-080674c82dd8bd2c0]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/f5ed223c4e7e9aed]
module.db_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-397310042]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=machamp-staging-subnet-group]
module.ecs_task_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2424528605]
module.ecs_task_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3277208484]
module.db_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-4293884430]
module.rds.aws_db_instance.this: Refreshing state... [id=machamp-staging-db]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb_listener.http will be destroyed
  - resource "aws_lb_listener" "http" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/f5ed223c4e7e9aed/999269377cadf747" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/f5ed223c4e7e9aed/999269377cadf747" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/f5ed223c4e7e9aed" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/cf06618b85acfcd6" -> null
          - type             = "forward" -> null
        }
    }

  # module.alb.aws_lb_listener.this[0] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/f5ed223c4e7e9aed"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener.this[1] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/f5ed223c4e7e9aed"
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.target_group will be destroyed
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/cf06618b85acfcd6" -> null
      - arn_suffix                         = "targetgroup/example/cf06618b85acfcd6" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/cf06618b85acfcd6" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "example" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09d8ac12538411d38" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 60 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.alb.aws_lb_target_group.this[0] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "staging-target-group-for-users"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09d8ac12538411d38"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.this[1] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "staging-target-group-for-test"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09d8ac12538411d38"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] must be replaced
-/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      ~ from_port                = 443 -> 8080 # forces replacement
      ~ id                       = "sgrule-2328878409" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      + source_security_group_id = (known after apply)
      ~ to_port                  = 443 -> 8080 # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-02ac63eb789f2e837"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.ecs.aws_ecs_service.service must be replaced
-/+ resource "aws_ecs_service" "service" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service" -> (known after apply)
        name                               = "machamp-staging-service"
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (12 unchanged attributes hidden)


      - load_balancer { # forces replacement
          - container_name   = "app" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/cf06618b85acfcd6" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }
      + load_balancer { # forces replacement
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>